app/Views/cliente/dashboard.php

SELECT *
FROM `profissional`
WHERE `usuario_id` = '1'
---
    $usuarioBloqueadoAte = $dadosUsuario['bloqueado_ate'] ?? '';

    // 2. Consulta o status do perfil PROFISSIONAL (Tabela 'profissional')
    $dadosProfissional = $db->table('profissional')
        ->where('usuario_id', $usuarioId)
        ->get()
        ->getRowArray();