app/Controllers/AdminController.php

SELECT `p`.`usuario_id` as `profissional_id`, `p`.`status`, `u`.`id` as `usuario_id`, `u`.`nome`, `u`.`email`, `u`.`dtCadastro`
FROM `profissional` `p`
JOIN `usuario` `u` ON `u`.`id` = `p`.`usuario_id`
WHERE `p`.`status` = 'em_analise'
SELECT `id`, `nome`, `email`, `dtCadastro`
FROM `usuario`
SELECT `id`, `categoria`, `categoria` as `nome`, `descricao`
FROM `categorias`
---
    public function dashboard()
    {
        // Busca profissionais pendentes utilizando dtCadastro
        $profissionaisPendentes = $this->db->table('profissional p')
            ->select('p.usuario_id as profissional_id, p.status, u.id as usuario_id, u.nome, u.email, u.dtCadastro')
            ->join('usuario u', 'u.id = p.usuario_id')
            ->where('p.status', 'em_analise')
            ->get()
            ->getResultArray();

        // Busca lista completa de usuários com dtCadastro
        $usuarios = $this->db->table('usuario')
            ->select('id, nome, email, dtCadastro')
            ->get()
            ->getResultArray();

        // Busca categorias
        $categorias = $this->db->table('categorias')
            ->select('id, categoria, categoria as nome, descricao')
            ->get()
            ->getResultArray();