app/Controllers/ProfissionalController.php

            'ativo'       => 1
        ];

        $usuarioId = $usuarioModel->insert($dadosUsuario);
---
INSERT INTO `usuario` (`nome`, `cpf`, `email`, `senha`, `cep`, `bairro`, `cidade`, `estado`) VALUES ('Sebastião Ronaldo', '588.888.887-77', 'sebastiao@hotmail.com', '$argon2id$v=19$m=65536,t=3,p=4$MGY5S1RONy9xUHl5aUNDag$UtgSTqaq9fynsbMjFNkXkCZRSSIkrGiuegmrww4mWyI', '17514-380', 'Jd Estoril', 'Marília', 'SP')

            'raio_atendimento_km' => $this->request->getPost('raio_atendimento_km'),
            'status'              => 'em_analise'
        ];
        $profissionalModel->insert($dadosProfissional);
---
INSERT INTO `profissional` (`usuario_id`, `descricaoPerfil`, `raio_atendimento_km`, `ativo`) VALUES (12, 'Ofereço serviços com qualidade e com compromisso.', '21', 1)

        $categorias = $this->request->getPost('categorias');
        if (!empty($categorias)) {
            foreach ($categorias as $catId) {
                $db->table('profissional_categorias')->insert([
                    'usuario_id'   => $usuarioId,
                    'categoria_id' => $catId
                ]);
---
INSERT INTO `profissional_categorias` (`usuario_id`, `categoria_id`) VALUES (12, '1')

    public function ativarPerfil()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('login')->with('erro', 'Faça login para acessar esta página.');
        }

        $categoriaModel = new CategoriaModel();
        $data['categorias'] = $categoriaModel->findAll();
---
SELECT *
FROM `categorias`