app/Controllers/UsuarioController.php

INSERT INTO `usuario` (`nome`, `cpf`, `email`, `senha`, `cidade`, `estado`, `bairro`, `cep`) VALUES ('Rosangela Ribeiro', '66888887777', 'rosangela@hotmail.com', '$argon2id$v=19$m=65536,t=3,p=4$d3p0T2hCaEZ2MDl3TkNRUg$TjGHjnOKFMG6MwBrZmvdLfrM9qB1+/eWr6+d0TsV8Ec', 'Marília', 'SP', 'Jd Estoril', '17526450')
---
            'ativo'  => 1 // Define como ativo por padrão no cadastro
        ];

        if ($usuarioModel->save($dados)) {

SELECT *
FROM `usuario`
WHERE `email` = 'carlos@hotmail.com'
 LIMIT 1
SELECT *
FROM `profissional`
WHERE `usuario_id` = '3'
---
    public function autenticar()
    {
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        $usuarioModel = new UsuarioModel();
        $usuario = $usuarioModel->where('email', $email)->first();

        if ($usuario) {
            // Valida a senha hash utilizando Argon2id + Pepper
            $pepper = env('security.passwordPepper', '');
            if (password_verify($senha . $pepper, $usuario['senha'])) {

                // 1. CHECAGEM DE SEGURANÇA: Verifica se a conta do usuário está suspensa/bloqueada
                if (isset($usuario['ativo']) && (int)$usuario['ativo'] !== 1) {
                    return redirect()->back()->withInput()->with('erro', 'Sua conta está suspensa. Entre em contato com a administração.');
                }

                $db = \Config\Database::connect();

                // Busca as informações do perfil profissional (usuario_id)
                $dadosProfissional = $db->table('profissional')
                    ->where('usuario_id', $usuario['id'])
                    ->get()
                    ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `administrador`
WHERE `usuario_id` = '3'
---
                $profissionalAprovado = $ehProfissional && isset($dadosProfissional['status']) && $dadosProfissional['status'] === 'ativo';

                // Checa se possui perfil de administrador (usuario_id)
                $ehAdmin = $db->table('administrador')
                    ->where('usuario_id', $usuario['id'])
                    ->countAllResults() > 0;